---
kind: other
id: Methods.T:Autodesk.Revit.DB.WallSweep
source: html/2d4d9227-13a8-a9c3-1e00-df5228b6a13d.htm
---
# WallSweep Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.